## Segment 2 - Treating missing values

In [2]:
import numpy as np
import pandas as pd
from jinja2.utils import missing

from pandas import Series, DataFrame

### Figuring out what data is missing

In [4]:
#Reading from CSV, more ref: https://www.datacamp.com/tutorial/pandas-read-csv
d1=pd.read_csv('./mtcars.csv')
d1.head()

,Unnamed: 0,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [6]:
missing = np.nan
series_obj = pd.Series(['row1', 'row2', missing, 'row4', 'row5', missing, 'row7'])
series_obj

0    row1
1    row2
2     NaN
3    row4
4    row5
5     NaN
6    row7
dtype: object

In [10]:
series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
dtype: bool

In [8]:
series_obj.isnull().sum()

np.int64(2)

In [9]:
series_obj.dropna()

0    row1
1    row2
3    row4
4    row5
6    row7
dtype: object

### Filling in for missing values

In [11]:
np.random.seed(25)
DF_obj = pd.DataFrame(np.random.rand(36).reshape(6,6))
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.520719  0.326051  0.699186
3  0.366395  0.836375  0.481343  0.516502  0.383048  0.997541
4  0.514244  0.559053  0.034450  0.719930  0.421004  0.436935
5  0.281701  0.900274  0.669612  0.456069  0.289804  0.525819

In [13]:
# DF_obj.loc[3:5, 0] = missing
# DF_obj.loc[1:4, 5] = missing
# DF_obj
DF_obj.loc[3:5, 0] = missing
DF_obj.loc[1:4,3] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229       NaN  0.402366  0.113041
2  0.447031  0.585445  0.161985       NaN  0.326051  0.699186
3       NaN  0.836375  0.481343       NaN  0.383048  0.997541
4       NaN  0.559053  0.034450       NaN  0.421004  0.436935
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [14]:
filled_DF_obj = DF_obj.fillna(0)
filled_DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.000000  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.000000  0.326051  0.699186
3  0.000000  0.836375  0.481343  0.000000  0.383048  0.997541
4  0.000000  0.559053  0.034450  0.000000  0.421004  0.436935
5  0.000000  0.900274  0.669612  0.456069  0.289804  0.525819

In [18]:
filled_DF_obj = DF_obj.fillna({0:'Col 1 Fill', 3:'Col 3 Fill'})
filled_DF_obj

            0         1         2           3         4         5
0    0.870124  0.582277  0.278839    0.185911  0.411100  0.117376
1    0.684969  0.437611  0.556229  Col 3 Fill  0.402366  0.113041
2    0.447031  0.585445  0.161985  Col 3 Fill  0.326051  0.699186
3  Col 1 Fill  0.836375  0.481343  Col 3 Fill  0.383048  0.997541
4  Col 1 Fill  0.559053  0.034450  Col 3 Fill  0.421004  0.436935
5  Col 1 Fill  0.900274  0.669612    0.456069  0.289804  0.525819

In [19]:
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229       NaN  0.402366  0.113041
2  0.447031  0.585445  0.161985       NaN  0.326051  0.699186
3       NaN  0.836375  0.481343       NaN  0.383048  0.997541
4       NaN  0.559053  0.034450       NaN  0.421004  0.436935
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [20]:
filled_DF = DF_obj.fillna(method='ffill')
filled_DF

C:\Users\zhang\AppData\Local\Temp\ipykernel_10232\257846808.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  filled_DF = DF_obj.fillna(method='ffill')

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.185911  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.185911  0.326051  0.699186
3  0.447031  0.836375  0.481343  0.185911  0.383048  0.997541
4  0.447031  0.559053  0.034450  0.185911  0.421004  0.436935
5  0.447031  0.900274  0.669612  0.456069  0.289804  0.525819

In [21]:
filled_DF = DF_obj.fillna(method='bfill')
filled_DF

C:\Users\zhang\AppData\Local\Temp\ipykernel_10232\70859300.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  filled_DF = DF_obj.fillna(method='bfill')

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.456069  0.402366  0.113041
2  0.447031  0.585445  0.161985  0.456069  0.326051  0.699186
3       NaN  0.836375  0.481343  0.456069  0.383048  0.997541
4       NaN  0.559053  0.034450  0.456069  0.421004  0.436935
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

### Counting missing values

In [22]:
np.random.seed(25)
DF_obj = DataFrame(np.random.rand(36).reshape(6,6))
DF_obj.loc[3:5, 0] = missing
DF_obj.loc[1:4, 5] = missing
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3       NaN  0.836375  0.481343  0.516502  0.383048       NaN
4       NaN  0.559053  0.034450  0.719930  0.421004       NaN
5       NaN  0.900274  0.669612  0.456069  0.289804  0.525819

In [23]:
DF_obj.isnull().sum()

0    3
1    0
2    0
3    0
4    0
5    4
dtype: int64

In [26]:
DF_obj[0] = DF_obj[0].fillna(DF_obj[0].mean())
DF_obj

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
1  0.684969  0.437611  0.556229  0.367080  0.402366       NaN
2  0.447031  0.585445  0.161985  0.520719  0.326051       NaN
3  0.667375  0.836375  0.481343  0.516502  0.383048       NaN
4  0.667375  0.559053  0.034450  0.719930  0.421004       NaN
5  0.667375  0.900274  0.669612  0.456069  0.289804  0.525819

### Filtering out missing values

In [29]:
D_no_NAN = DF_obj.dropna()
DF_no_NAN

          0         1         2         3         4         5
0  0.870124  0.582277  0.278839  0.185911  0.411100  0.117376
5  0.667375  0.900274  0.669612  0.456069  0.289804  0.525819

In [30]:
DF_no_NAN = DF_obj.dropna(axis = 1)
DF_no_NAN

          0         1         2         3         4
0  0.870124  0.582277  0.278839  0.185911  0.411100
1  0.684969  0.437611  0.556229  0.367080  0.402366
2  0.447031  0.585445  0.161985  0.520719  0.326051
3  0.667375  0.836375  0.481343  0.516502  0.383048
4  0.667375  0.559053  0.034450  0.719930  0.421004
5  0.667375  0.900274  0.669612  0.456069  0.289804

# Class exercise 1:
Hereâ€™s a sample dataset you can use. You can copy this directly into a DataFrame:

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', None],
    'Age': [24, None, 22, 23, None, 29],
    'Score': [85, 70, None, 88, 95, 90],
    'City': ['New York', 'Los Angeles', None, 'Chicago', 'Houston', None]
}

df = pd.DataFrame(data)

print(df)

Tasks:
1. Detecting Missing Values
Check for missing values in the dataset
2. Dropping Missing Values


*   Drop rows with any missing values.
d1=df.dropna(how='any')
*   Drop rows only if all values in the row are missing.

d1=df.dropna(how='all')

d1=df[df.isnull().sum(axis=1)!=len(data.keys())]

*   Drop columns with missing values

3. Filling Missing Values

*   Fill with a fixed value (e.g., 0 or 'Unknown').
*   Fill using forward-fill (propagate last valid value).
*   Fill using backward-fill.

4. Filling with Mean/Median/Mode

*   Fill numerical columns with the mean value.
*   Fill categorical columns with the mode.

5. Replacing Values with replace()

 Replace specific values like None or NaN.

In [31]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', None],
    'Age': [24, None, 22, 23, None, 29],
    'Score': [85, 70, None, 88, 95, 90],
    'City': ['New York', 'Los Angeles', None, 'Chicago', 'Houston', None]
}

df = pd.DataFrame(data)

df

      Name   Age  Score         City
0    Alice  24.0   85.0     New York
1      Bob   NaN   70.0  Los Angeles
2  Charlie  22.0    NaN         None
3    David  23.0   88.0      Chicago
4      Eve   NaN   95.0      Houston
5     None  29.0   90.0         None

In [33]:
# Detecting Missing Values
df.isnull().sum()

Name     1
Age      2
Score    1
City     2
dtype: int64

In [34]:
# drop rows containing any missing values
df_any = df.dropna(how='any')
df_any

    Name   Age  Score      City
0  Alice  24.0   85.0  New York
3  David  23.0   88.0   Chicago

In [35]:
# drop rows only if all values in the row are missing
df_all = df.dropna(how='all')
df_all

      Name   Age  Score         City
0    Alice  24.0   85.0     New York
1      Bob   NaN   70.0  Los Angeles
2  Charlie  22.0    NaN         None
3    David  23.0   88.0      Chicago
4      Eve   NaN   95.0      Houston
5     None  29.0   90.0         None

In [39]:
df_no_na = df.dropna()
df_no_na

    Name   Age  Score      City
0  Alice  24.0   85.0  New York
3  David  23.0   88.0   Chicago

In [36]:
# fill with a fixed value (e.g., 0 or 'Unknown').
df_filled_0 = df.fillna(0)
df_filled_0

      Name   Age  Score         City
0    Alice  24.0   85.0     New York
1      Bob   0.0   70.0  Los Angeles
2  Charlie  22.0    0.0            0
3    David  23.0   88.0      Chicago
4      Eve   0.0   95.0      Houston
5        0  29.0   90.0            0

In [37]:
df_filled_unknown = df.fillna('Unknown')
df_filled_unknown

      Name      Age    Score         City
0    Alice     24.0     85.0     New York
1      Bob  Unknown     70.0  Los Angeles
2  Charlie     22.0  Unknown      Unknown
3    David     23.0     88.0      Chicago
4      Eve  Unknown     95.0      Houston
5  Unknown     29.0     90.0      Unknown

In [41]:
df_filled_ffill = df.fillna(method='ffill')
df_filled_ffill

C:\Users\zhang\AppData\Local\Temp\ipykernel_10232\3888357887.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_ffill = df.fillna(method='ffill')

      Name   Age  Score         City
0    Alice  24.0   85.0     New York
1      Bob  24.0   70.0  Los Angeles
2  Charlie  22.0   70.0  Los Angeles
3    David  23.0   88.0      Chicago
4      Eve  23.0   95.0      Houston
5      Eve  29.0   90.0      Houston

In [42]:
df_filled_bfill = df.fillna(method='bfill')
df_filled_bfill

C:\Users\zhang\AppData\Local\Temp\ipykernel_10232\4074532260.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_filled_bfill = df.fillna(method='bfill')

      Name   Age  Score         City
0    Alice  24.0   85.0     New York
1      Bob  22.0   70.0  Los Angeles
2  Charlie  22.0   88.0      Chicago
3    David  23.0   88.0      Chicago
4      Eve  29.0   95.0      Houston
5     None  29.0   90.0         None

In [45]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Score'] = df['Score'].fillna(df['Score'].mode())
df

      Name   Age  Score         City
0    Alice  24.0   85.0     New York
1      Bob  24.5   70.0  Los Angeles
2  Charlie  22.0   88.0         None
3    David  23.0   88.0      Chicago
4      Eve  24.5   95.0      Houston
5     None  29.0   90.0         None

# Class exercise 2:
use https://www.kaggle.com/datasets/gunjanpathak/melb-data dataset and find the missing values and replace it with mean values.

In [48]:
df_melb = pd.read_csv('./melb_data.csv', index_col=0)
df_melb.head(10)

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra,-37.7996,144.9984,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra,-37.8079,144.9934,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra,-37.8093,144.9944,Northern Metropolitan,4019.0
5,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra,-37.7969,144.9969,Northern Metropolitan,4019.0
6,Abbotsford,55a Park St,4,h,1600000.0,VB,Nelson,4/06/2016,2.5,3067.0,...,1.0,2.0,120.0,142.0,2014.0,Yarra,-37.8072,144.9941,Northern Metropolitan,4019.0
10,Abbotsford,129 Charles St,2,h,941000.0,S,Jellis,7/05/2016,2.5,3067.0,...,1.0,0.0,181.0,NaN,NaN,Yarra,-37.8041,144.9953,Northern Metropolitan,4019.0
11,Abbotsford,124 Yarra St,3,h,1876000.0,S,Nelson,7/05/2016,2.5,3067.0,...,2.0,0.0,245.0,210.0,1910.0,Yarra,-37.8024,144.9993,Northern Metropolitan,4019.0
14,Abbotsford,98 Charles St,2,h,1636000.0,S,Nelson,8/10/2016,2.5,3067.0,...,1.0,2.0,256.0,107.0,1890.0,Yarra,-37.8060,144.9954,Northern Metropolitan,4019.0
15,Abbotsford,217 Langridge St,3,h,1000000.0,S,Jellis,8/10/2016,2.5,3067.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,4019.0
16,Abbotsford,18a Mollison St,2,t,745000.0,S,Jellis,8/10/2016,2.5,3067.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Northern Metropolitan,4019.0

In [51]:
# detect missing values
df_melb.isnull().sum()

Suburb               0
Address              0
Rooms                0
Type                 0
Price                0
Method               0
SellerG              0
Date                 0
Distance             1
Postcode             1
Bedroom2          3469
Bathroom          3471
Car               3576
Landsize          4793
BuildingArea     10634
YearBuilt         9438
CouncilArea       6163
Lattitude         3332
Longtitude        3332
Regionname           1
Propertycount        1
dtype: int64

In [52]:
df_melb['Distance'] = df_melb['Distance'].fillna(df_melb['Distance'].mean())
df_melb['Postcode'] = df_melb['Postcode'].fillna(df_melb['Postcode'].mean())
df_melb.isnull().sum()

Suburb               0
Address              0
Rooms                0
Type                 0
Price                0
Method               0
SellerG              0
Date                 0
Distance             0
Postcode             0
Bedroom2          3469
Bathroom          3471
Car               3576
Landsize          4793
BuildingArea     10634
YearBuilt         9438
CouncilArea       6163
Lattitude         3332
Longtitude        3332
Regionname           1
Propertycount        1
dtype: int64